--[[
测试内容，通过后标记为ok

1、斩首
@测试死亡
@测试资金变化


2、巩固忠诚
@测试人物满意度
@测试资金变化



3、结拜
@测试人物满意度
@测试人物义亲效果
@测试资金变化
@测试主公有/无父亲下，家谱的变化：有父亲则兄弟进入家谱，无父亲则兄弟不进入家谱

4、纳妻
@测试同性异性条件
@测试已经是主公伴侣情况，是否有按钮

@测试主公单身下操作后（中途不选择放弃）：新人是否变为正室，所有旧人的伴侣是否为主公
@测试主公非单身下操作后（中途不选择放弃）：新人是否变为正室，所有旧人的伴侣是否为主公

@测试主公单身/非单身：中途选择放弃，新人是否正常，新人原来的伴侣是否正常，主公是否正常，主公的所有旧人是否正常
@测试资金变化


5、纳妾
@测试同性异性条件
@测试已经是主公伴侣的情况下，是否有按钮

@测试主公单身下操作后（中途不选择放弃）：新人是否变为正室，所有旧人的伴侣是否为主公
@测试主公非单身下操作后（中途不选择放弃）：新人是否变为侧室，所有旧人的伴侣是否为主公

@测试主公单身/非单身：中途选择放弃，新人是否正常，新人原来的伴侣是否正常，主公是否正常，主公的所有旧人是否正常
@测试资金变化



]]--